#+TITLE: org-ai Interactive Demo
#+AUTHOR: Emacs AI Study Group
#+DATE: [2025-01-03]
#+PROPERTY: header-args:emacs-lisp :results output :exports both
#+STARTUP: showeverything

** org-babel Integration

#+BEGIN_SRC emacs-lisp
(defun demo-org-babel-integration ()
  "Demonstrate org-ai with org-babel."
  (interactive)
  (message "org-ai + org-babel Integration:

Generate code with org-ai, execute with babel!

Example:

#+begin_ai
[ME]: Write a function to fetch JSON from a URL using plz.el
#+end_ai

[AI provides code]

Now test it:

#+begin_src emacs-lisp :results output
(defun fetch-json (url)
  ;; [AI-generated code here]
  )

(fetch-json \"https://api.example.com/data\")
#+end_src

#+RESULTS:
: {\"status\": \"ok\", ...}

Workflow:
1. Ask AI for code (#+begin_ai)
2. Copy to src block
3. Execute with C-c C-c
4. If issues, ask AI in same document
5. Iterate until working

Result: Documented, tested, reproducible!

Also useful for:
- Data analysis scripts
- Example demonstrations
- Tutorial generation
- Test-driven development"))

(demo-org-babel-integration)
#+END_SRC

